src/cf/InformationRegisters/CRM_ОписаниеРеквизитовМетаданных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>CRM_ОписаниеРеквизитовМетаданных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Реквизит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/CRM_ОписаниеРеквизитовМетаданных/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Процедура ОбновитьЗаписи() Экспорт
	МассивМетаданных = Новый Массив();
	МассивМетаданных.Добавить(Метаданные.Справочники.Партнеры);
	МассивМетаданных.Добавить(Метаданные.Справочники.КонтактныеЛицаПартнеров);
	
	МассивИтераторыРеквизитов = Новый Массив();
	МассивИтераторыРеквизитов.Добавить("СтандартныеРеквизиты");
	МассивИтераторыРеквизитов.Добавить("РеквизитыАдресации");
	МассивИтераторыРеквизитов.Добавить("Измерения");
	МассивИтераторыРеквизитов.Добавить("Ресурсы");
	МассивИтераторыРеквизитов.Добавить("Реквизиты");
	
	НаборЗаписей = РегистрыСведений.CRM_ОписаниеРеквизитовМетаданных.СоздатьНаборЗаписей();
	
	Для Каждого ОбъектМетаданных Из МассивМетаданных Цикл
		Для Каждого ИмяИтератора Из МассивИтераторыРеквизитов Цикл
			Попытка		Итератор = ОбъектМетаданных[ИмяИтератора];
			Исключение	Итератор = Неопределено;
			КонецПопытки;
			Если Итератор <> Неопределено Тогда
				Для Каждого Реквизит Из Итератор Цикл
					Имя = Реквизит.Имя;
					Представление = ?(ЗначениеЗаполнено(Реквизит.Представление()), Реквизит.Представление(), Реквизит.Имя);
					Если Не ЗначениеЗаполнено(Имя) Или Не ЗначениеЗаполнено(Представление) Тогда
						Продолжить;
					КонецЕсли;
					НоваяСтрока = НаборЗаписей.Добавить();
					НоваяСтрока.Объект = ОбъектМетаданных.ПолноеИмя();
					НоваяСтрока.Реквизит = Имя;
					НоваяСтрока.Представление = Представление;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	НаборЗаписей.Записать();
КонецПроцедуры

#КонецЕсли
